Revit 2027 API
ScheduleDefinition.IsKeySchedule Property
 Indicates if the schedule is a key schedule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsKeySchedule { get; }
Public ReadOnly Property IsKeySchedule As Boolean
	Get
public:
property bool IsKeySchedule {
	bool get ();
}
member IsKeySchedule : bool with get
Property Value
Boolean
Remarks
 A key schedule displays abstract "key" elements that can be used to populate parameters of ordinary model elements.
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace